# Taps
tap "homebrew/cask-fonts"

# CLI tools
brew "fish"
brew "node"
brew "gemini-cli"
brew "gh"
brew "openjdk@17", link: true
brew "poppler"
brew "uv"
brew "mackup"

# GUI Apps
cask "alfred"
cask "anki"
cask "chatgpt"
cask "claude"
cask "cloudflare-warp"
cask "cursor"
cask "dropbox"
cask "flux-app"
cask "google-chrome"
cask "hiddenbar"
cask "iina"
cask "karabiner-elements"
cask "mactex-no-gui"
cask "miniconda"
cask "notion"
cask "rectangle"
cask "scroll-reverser"
cask "simpletex"
cask "snipaste"
cask "tencent-meeting"
cask "ticktick"
cask "wechat"
cask "xmind"
cask "zoom"

# Manual install (not available in brew):
# - 幕布 (mubu.com)
# - Mathpix Snipping Tool
# - Input Source Pro
# - WPS Office (wpsoffice.cn)
# - BaiduNetdisk
# - Typeless

# VS Code Extensions
vscode "anthropic.claude-code"
vscode "anysphere.cursorpyright"
vscode "anysphere.remote-containers"
vscode "anysphere.remote-ssh"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "f-loat.jsonl-converter"
vscode "james-yu.latex-workshop"
vscode "ms-ceintl.vscode-language-pack-zh-hans"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-repositories"
vscode "openai.chatgpt"
vscode "tomoki1207.pdf"
vscode "urin.vscode-web-visual-editor"
vscode "vscodevim.vim"
