anthropic.claude-code
anysphere.cursorpyright
anysphere.remote-containers
anysphere.remote-ssh
eamodio.gitlens
ecmel.vscode-html-css
f-loat.jsonl-converter
james-yu.latex-workshop
ms-ceintl.vscode-language-pack-zh-hans
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-wsl
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.live-server
ms-vscode.remote-repositories
openai.chatgpt
tomoki1207.pdf
urin.vscode-web-visual-editor
vscodevim.vim
